In [1]:
# Import dependencies
import pandas as pd
from path import Path

# from sklearn import tree
# from sklearn.preprocessing import StandardScaler, OneHotEncoder
# from sklearn.model_selection import train_test_split
# from sklearn.metrics import confusion_matrix, accuracy_score, classification_report

from sqlalchemy import create_engine
import psycopg2
from config import db_password

# import numpy as np
# import seaborn as sns
# import matplotlib.pyplot as plt
# from matplotlib import rc
# %matplotlib inline

## Raw data file evaluation
#### Read the SOURCE file and load the raw data into the database.

In [2]:
filepath = "./Resources/aac_intakes_outcomes.csv"
shelter_input_raw_df = pd.read_csv(filepath)
shelter_input_raw_df.head()

,age_upon_outcome,animal_id_outcome,date_of_birth,outcome_subtype,outcome_type,sex_upon_outcome,age_upon_outcome_(days),age_upon_outcome_(years),age_upon_outcome_age_group,outcome_datetime,...,age_upon_intake_age_group,intake_datetime,intake_month,intake_year,intake_monthyear,intake_weekday,intake_hour,intake_number,time_in_shelter,time_in_shelter_days
0,10 years,A006100,2007-07-09 00:00:00,NaN,Return to Owner,Neutered Male,3650,10.0,"(7.5, 10.0]",2017-12-07 14:07:00,...,"(7.5, 10.0]",2017-12-07 00:00:00,12,2017,2017-12,Thursday,14,1.0,0 days 14:07:00.000000000,0.588194
1,7 years,A006100,2007-07-09 00:00:00,NaN,Return to Owner,Neutered Male,2555,7.0,"(5.0, 7.5]",2014-12-20 16:35:00,...,"(5.0, 7.5]",2014-12-19 10:21:00,12,2014,2014-12,Friday,10,2.0,1 days 06:14:00.000000000,1.259722
2,6 years,A006100,2007-07-09 00:00:00,NaN,Return to Owner,Neutered Male,2190,6.0,"(5.0, 7.5]",2014-03-08 17:10:00,...,"(5.0, 7.5]",2014-03-07 14:26:00,3,2014,2014-03,Friday,14,3.0,1 days 02:44:00.000000000,1.113889
3,10 years,A047759,2004-04-02 00:00:00,Partner,Transfer,Neutered Male,3650,10.0,"(7.5, 10.0]",2014-04-07 15:12:00,...,"(7.5, 10.0]",2014-04-02 15:55:00,4,2014,2014-04,Wednesday,15,1.0,4 days 23:17:00.000000000,4.970139
4,16 years,A134067,1997-10-16 00:00:00,NaN,Return to Owner,Neutered Male,5840,16.0,"(15.0, 17.5]",2013-11-16 11:54:00,...,"(15.0, 17.5]",2013-11-16 09:02:00,11,2013,2013-11,Saturday,9,1.0,0 days 02:52:00.000000000,0.119444

In [3]:
# print(len(shelter_input_raw_df))
print(f"Raw File Record Count: {len(shelter_input_raw_df)} ")

Raw File Record Count: 79672

In [4]:
# Check to identify primary key column
shelter_input_raw_df.nunique()

age_upon_outcome                 46
animal_id_outcome             71961
date_of_birth                  5923
outcome_subtype                  19
outcome_type                      9
sex_upon_outcome                  5
age_upon_outcome_(days)          45
age_upon_outcome_(years)         45
age_upon_outcome_age_group       10
outcome_datetime              65686
outcome_month                    12
outcome_year                      6
outcome_monthyear                55
outcome_weekday                   7
outcome_hour                     24
outcome_number                   13
dob_year                         28
dob_month                        12
dob_monthyear                    55
age_upon_intake                  46
animal_id_intake              71961
animal_type                       4
breed                          2155
color                           529
found_location                36576
intake_condition                  8
intake_type                       5
sex_upon_intake                   5
count                             1
age_upon_intake_(days)           45
age_upon_intake_(years)          45
age_upon_intake_age_group        10
intake_datetime               56747
intake_month                     12
intake_year                       6
intake_monthyear                 54
intake_weekday                    7
intake_hour                      24
intake_number                    13
time_in_shelter               29319
time_in_shelter_days          29319
dtype: int64

In [5]:
# Verifying the counts on raw dataset priro to pre-processing
# shelter_input_raw_df.drop_duplicates()
shelter_input_raw_df.count()

age_upon_outcome              79672
animal_id_outcome             79672
date_of_birth                 79672
outcome_subtype               36348
outcome_type                  79662
sex_upon_outcome              79671
age_upon_outcome_(days)       79672
age_upon_outcome_(years)      79672
age_upon_outcome_age_group    79672
outcome_datetime              79672
outcome_month                 79672
outcome_year                  79672
outcome_monthyear             79672
outcome_weekday               79672
outcome_hour                  79672
outcome_number                79672
dob_year                      79672
dob_month                     79672
dob_monthyear                 79672
age_upon_intake               79672
animal_id_intake              79672
animal_type                   79672
breed                         79672
color                         79672
found_location                79672
intake_condition              79672
intake_type                   79672
sex_upon_intake               79671
count                         79672
age_upon_intake_(days)        79672
age_upon_intake_(years)       79672
age_upon_intake_age_group     79672
intake_datetime               79672
intake_month                  79672
intake_year                   79672
intake_monthyear              79672
intake_weekday                79672
intake_hour                   79672
intake_number                 79672
time_in_shelter               79672
time_in_shelter_days          79672
dtype: int64

In [6]:
shelter_input_raw_df.dtypes

age_upon_outcome               object
animal_id_outcome              object
date_of_birth                  object
outcome_subtype                object
outcome_type                   object
sex_upon_outcome               object
age_upon_outcome_(days)         int64
age_upon_outcome_(years)      float64
age_upon_outcome_age_group     object
outcome_datetime               object
outcome_month                   int64
outcome_year                    int64
outcome_monthyear              object
outcome_weekday                object
outcome_hour                    int64
outcome_number                float64
dob_year                        int64
dob_month                       int64
dob_monthyear                  object
age_upon_intake                object
animal_id_intake               object
animal_type                    object
breed                          object
color                          object
found_location                 object
intake_condition               object
intake_type                    object
sex_upon_intake                object
count                           int64
age_upon_intake_(days)          int64
age_upon_intake_(years)       float64
age_upon_intake_age_group      object
intake_datetime                object
intake_month                    int64
intake_year                     int64
intake_monthyear               object
intake_weekday                 object
intake_hour                     int64
intake_number                 float64
time_in_shelter                object
time_in_shelter_days          float64
dtype: object

## Building database connection and loading raw data file
#### loading data with not preprocessing / Raw data dump into the database is the first step.

### Database setup Instruction:

Step 1 - Login into your local pgAdmin and CREATE "shelter_db" database. This step is required prior to executing the below DB panda code.

Step 2 - After loading the raw file into SQL table "raw_input_outcome", open pdAdmin and execute the following create script.   ( CREATE TABLE animal_type as SELECT DISTINCT animal_id_intake as animal_id, breed, color, animal_type FROM raw_input_outcome;)

Step 3 - Continue with panda code to create the thrid db object "animal_in_out" 

Step 4 - Execute the following alter table scripts in PgAdmin to create primary and foreign key relationship

ALTER TABLE animal_type
ADD CONSTRAINT animal_id_pk PRIMARY KEY (animal_id);

ALTER TABLE animal_in_out
ADD CONSTRAINT id_pk PRIMARY KEY (id);

ALTER TABLE animal_in_out
ADD CONSTRAINT animal_id_intake_fk FOREIGN KEY (animal_id_intake) REFERENCES animal_type (animal_id);

Step 5 - End of databse setup

In [7]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\bandi\anaconda3\envs\pythondata\lib\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [8]:
# db_password="888888"

In [9]:
# print(db_string)

In [10]:
# Import input dataset to dataframe (module 8.5.1, https://www.techtrekking.com/how-to-read-data-from-postgresql-to-pandas-dataframe/)
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/shelter_db"

In [11]:
engine = create_engine(db_string)

In [12]:
# shelter_input_raw_df = shelter_input_raw_df.drop(['age_upon_outcome_(days)','age_upon_outcome_(years)','age_upon_intake_(days)','age_upon_intake_(years)'], axis=1)
# Renaming the column names to match the SQL standards
shelter_input_raw_df.rename(columns={"age_upon_outcome_(days)": "age_upon_outcome_days", 
                                      "age_upon_outcome_(years)": "age_upon_outcome_years",
                                      "age_upon_intake_(days)" : "age_upon_intake_days",
                                      "age_upon_intake_(years)" : "age_upon_intake_years" 
                                    }, inplace = True) 
shelter_input_raw_df.head()

,age_upon_outcome,animal_id_outcome,date_of_birth,outcome_subtype,outcome_type,sex_upon_outcome,age_upon_outcome_days,age_upon_outcome_years,age_upon_outcome_age_group,outcome_datetime,...,age_upon_intake_age_group,intake_datetime,intake_month,intake_year,intake_monthyear,intake_weekday,intake_hour,intake_number,time_in_shelter,time_in_shelter_days
0,10 years,A006100,2007-07-09 00:00:00,NaN,Return to Owner,Neutered Male,3650,10.0,"(7.5, 10.0]",2017-12-07 14:07:00,...,"(7.5, 10.0]",2017-12-07 00:00:00,12,2017,2017-12,Thursday,14,1.0,0 days 14:07:00.000000000,0.588194
1,7 years,A006100,2007-07-09 00:00:00,NaN,Return to Owner,Neutered Male,2555,7.0,"(5.0, 7.5]",2014-12-20 16:35:00,...,"(5.0, 7.5]",2014-12-19 10:21:00,12,2014,2014-12,Friday,10,2.0,1 days 06:14:00.000000000,1.259722
2,6 years,A006100,2007-07-09 00:00:00,NaN,Return to Owner,Neutered Male,2190,6.0,"(5.0, 7.5]",2014-03-08 17:10:00,...,"(5.0, 7.5]",2014-03-07 14:26:00,3,2014,2014-03,Friday,14,3.0,1 days 02:44:00.000000000,1.113889
3,10 years,A047759,2004-04-02 00:00:00,Partner,Transfer,Neutered Male,3650,10.0,"(7.5, 10.0]",2014-04-07 15:12:00,...,"(7.5, 10.0]",2014-04-02 15:55:00,4,2014,2014-04,Wednesday,15,1.0,4 days 23:17:00.000000000,4.970139
4,16 years,A134067,1997-10-16 00:00:00,NaN,Return to Owner,Neutered Male,5840,16.0,"(15.0, 17.5]",2013-11-16 11:54:00,...,"(15.0, 17.5]",2013-11-16 09:02:00,11,2013,2013-11,Saturday,9,1.0,0 days 02:52:00.000000000,0.119444

In [13]:
# Loading base animal intake data into databse
conn = engine.connect()

shelter_input_raw_df.to_sql(name='raw_input_outcome', con=conn, if_exists='replace', index=False)

In [14]:
# validating the raw data file load
animals_df = pd.read_sql("SELECT * FROM \"raw_input_outcome\"", con=engine)
animals_df.head(10)

,age_upon_outcome,animal_id_outcome,date_of_birth,outcome_subtype,outcome_type,sex_upon_outcome,age_upon_outcome_days,age_upon_outcome_years,age_upon_outcome_age_group,outcome_datetime,...,age_upon_intake_age_group,intake_datetime,intake_month,intake_year,intake_monthyear,intake_weekday,intake_hour,intake_number,time_in_shelter,time_in_shelter_days
0,10 years,A006100,2007-07-09 00:00:00,None,Return to Owner,Neutered Male,3650,10.0,"(7.5, 10.0]",2017-12-07 14:07:00,...,"(7.5, 10.0]",2017-12-07 00:00:00,12,2017,2017-12,Thursday,14,1.0,0 days 14:07:00.000000000,0.588194
1,7 years,A006100,2007-07-09 00:00:00,None,Return to Owner,Neutered Male,2555,7.0,"(5.0, 7.5]",2014-12-20 16:35:00,...,"(5.0, 7.5]",2014-12-19 10:21:00,12,2014,2014-12,Friday,10,2.0,1 days 06:14:00.000000000,1.259722
2,6 years,A006100,2007-07-09 00:00:00,None,Return to Owner,Neutered Male,2190,6.0,"(5.0, 7.5]",2014-03-08 17:10:00,...,"(5.0, 7.5]",2014-03-07 14:26:00,3,2014,2014-03,Friday,14,3.0,1 days 02:44:00.000000000,1.113889
3,10 years,A047759,2004-04-02 00:00:00,Partner,Transfer,Neutered Male,3650,10.0,"(7.5, 10.0]",2014-04-07 15:12:00,...,"(7.5, 10.0]",2014-04-02 15:55:00,4,2014,2014-04,Wednesday,15,1.0,4 days 23:17:00.000000000,4.970139
4,16 years,A134067,1997-10-16 00:00:00,None,Return to Owner,Neutered Male,5840,16.0,"(15.0, 17.5]",2013-11-16 11:54:00,...,"(15.0, 17.5]",2013-11-16 09:02:00,11,2013,2013-11,Saturday,9,1.0,0 days 02:52:00.000000000,0.119444
5,15 years,A141142,1998-06-01 00:00:00,None,Return to Owner,Spayed Female,5475,15.0,"(12.5, 15.0]",2013-11-17 11:40:00,...,"(12.5, 15.0]",2013-11-16 14:46:00,11,2013,2013-11,Saturday,14,1.0,0 days 20:54:00.000000000,0.870833
6,15 years,A163459,1999-10-19 00:00:00,None,Return to Owner,Intact Female,5475,15.0,"(12.5, 15.0]",2014-11-14 19:28:00,...,"(12.5, 15.0]",2014-11-14 15:11:00,11,2014,2014-11,Friday,15,1.0,0 days 04:17:00.000000000,0.178472
7,15 years,A165752,1999-08-18 00:00:00,None,Return to Owner,Neutered Male,5475,15.0,"(12.5, 15.0]",2014-09-15 16:35:00,...,"(12.5, 15.0]",2014-09-15 11:28:00,9,2014,2014-09,Monday,11,1.0,0 days 05:07:00.000000000,0.213194
8,15 years,A178569,1999-03-17 00:00:00,None,Return to Owner,Neutered Male,5475,15.0,"(12.5, 15.0]",2014-03-23 15:57:00,...,"(12.5, 15.0]",2014-03-17 09:45:00,3,2014,2014-03,Monday,9,1.0,6 days 06:12:00.000000000,6.258333
9,18 years,A189592,1997-08-01 00:00:00,None,Return to Owner,Spayed Female,6570,18.0,"(17.5, 20.0]",2015-09-18 19:04:00,...,"(17.5, 20.0]",2015-09-18 17:46:00,9,2015,2015-09,Friday,17,1.0,0 days 01:18:00.000000000,0.054167

### Execute the below script from your local pgamin to create the master table "animal_type".

#### -- Create a animal_info table to create a lookup bse table.
Create table animal_type as select distinct animal_id_intake as animal_id, breed, color, animal_type from raw_input_outcome;

In [15]:
# Animal lookup table is created from the raw table
# This table was created of the raw table using SQL script
# This is unique dataset.Each animal_id corresponds to a unique animal category 

animaltype_df = pd.read_sql("SELECT * FROM \"animal_type\"", con=engine)
animaltype_df.head(10)

  animal_id                        breed              color animal_type
0   A006100         Spinone Italiano Mix       Yellow/White         Dog
1   A047759                    Dachshund           Tricolor         Dog
2   A134067            Shetland Sheepdog        Brown/White         Dog
3   A141142  Labrador Retriever/Pit Bull        Black/White         Dog
4   A163459      Miniature Schnauzer Mix         Black/Gray         Dog
5   A165752               Lhasa Apso Mix        Brown/White         Dog
6   A178569        Shetland Sheepdog Mix        White/Black         Dog
7   A189592        Shetland Sheepdog Mix        Brown/White         Dog
8   A191351        Domestic Longhair Mix        Black/White         Cat
9   A197810       American Shorthair Mix  Brown Tabby/White         Cat

## Dropping off the lookup columns from animals_df and create a new table

In [16]:
animal_new_df = animals_df.drop(['breed','color','animal_type','outcome_subtype'], axis=1)

In [17]:
animal_new_df.reset_index(drop=True, inplace=True)

In [18]:
# setting Animal_id_outcome as index column
# animal_new_df.set_index("animal_id_outcome", inplace = True)
# animal_new_df.set_index(inplace=True)
# animal_new_df.head()

In [19]:
# df.insert(0, 'New_ID', range(880, 880 + len(df)))
# Creting a new column to create a primary key column on the intake table.

animal_new_df.insert(0, 'id',range(1, 1 + len(animal_new_df)))

In [20]:
animal_new_df.head()

,id,age_upon_outcome,animal_id_outcome,date_of_birth,outcome_type,sex_upon_outcome,age_upon_outcome_days,age_upon_outcome_years,age_upon_outcome_age_group,outcome_datetime,...,age_upon_intake_age_group,intake_datetime,intake_month,intake_year,intake_monthyear,intake_weekday,intake_hour,intake_number,time_in_shelter,time_in_shelter_days
0,1,10 years,A006100,2007-07-09 00:00:00,Return to Owner,Neutered Male,3650,10.0,"(7.5, 10.0]",2017-12-07 14:07:00,...,"(7.5, 10.0]",2017-12-07 00:00:00,12,2017,2017-12,Thursday,14,1.0,0 days 14:07:00.000000000,0.588194
1,2,7 years,A006100,2007-07-09 00:00:00,Return to Owner,Neutered Male,2555,7.0,"(5.0, 7.5]",2014-12-20 16:35:00,...,"(5.0, 7.5]",2014-12-19 10:21:00,12,2014,2014-12,Friday,10,2.0,1 days 06:14:00.000000000,1.259722
2,3,6 years,A006100,2007-07-09 00:00:00,Return to Owner,Neutered Male,2190,6.0,"(5.0, 7.5]",2014-03-08 17:10:00,...,"(5.0, 7.5]",2014-03-07 14:26:00,3,2014,2014-03,Friday,14,3.0,1 days 02:44:00.000000000,1.113889
3,4,10 years,A047759,2004-04-02 00:00:00,Transfer,Neutered Male,3650,10.0,"(7.5, 10.0]",2014-04-07 15:12:00,...,"(7.5, 10.0]",2014-04-02 15:55:00,4,2014,2014-04,Wednesday,15,1.0,4 days 23:17:00.000000000,4.970139
4,5,16 years,A134067,1997-10-16 00:00:00,Return to Owner,Neutered Male,5840,16.0,"(15.0, 17.5]",2013-11-16 11:54:00,...,"(15.0, 17.5]",2013-11-16 09:02:00,11,2013,2013-11,Saturday,9,1.0,0 days 02:52:00.000000000,0.119444

In [21]:
#The number of rows should match to the original source file

print(f"Raw File after dropping few columns Record Count: {len(animal_new_df)} ")

Raw File after dropping few columns Record Count: 79672

In [22]:
# create table with exploratory output columns
conn = engine.connect()

animal_new_df.to_sql(name='animal_in_out', con=conn, if_exists='replace', index=False)

In [23]:
# Check for unique values. 
animal_new_df.nunique()

id                            79672
age_upon_outcome                 46
animal_id_outcome             71961
date_of_birth                  5923
outcome_type                      9
sex_upon_outcome                  5
age_upon_outcome_days            45
age_upon_outcome_years           45
age_upon_outcome_age_group       10
outcome_datetime              65686
outcome_month                    12
outcome_year                      6
outcome_monthyear                55
outcome_weekday                   7
outcome_hour                     24
outcome_number                   13
dob_year                         28
dob_month                        12
dob_monthyear                    55
age_upon_intake                  46
animal_id_intake              71961
found_location                36576
intake_condition                  8
intake_type                       5
sex_upon_intake                   5
count                             1
age_upon_intake_days             45
age_upon_intake_years            45
age_upon_intake_age_group        10
intake_datetime               56747
intake_month                     12
intake_year                       6
intake_monthyear                 54
intake_weekday                    7
intake_hour                      24
intake_number                    13
time_in_shelter               29319
time_in_shelter_days          29319
dtype: int64

In [24]:
# Check for record county before dropping duplicates
animal_new_df.count()

id                            79672
age_upon_outcome              79672
animal_id_outcome             79672
date_of_birth                 79672
outcome_type                  79662
sex_upon_outcome              79671
age_upon_outcome_days         79672
age_upon_outcome_years        79672
age_upon_outcome_age_group    79672
outcome_datetime              79672
outcome_month                 79672
outcome_year                  79672
outcome_monthyear             79672
outcome_weekday               79672
outcome_hour                  79672
outcome_number                79672
dob_year                      79672
dob_month                     79672
dob_monthyear                 79672
age_upon_intake               79672
animal_id_intake              79672
found_location                79672
intake_condition              79672
intake_type                   79672
sex_upon_intake               79671
count                         79672
age_upon_intake_days          79672
age_upon_intake_years         79672
age_upon_intake_age_group     79672
intake_datetime               79672
intake_month                  79672
intake_year                   79672
intake_monthyear              79672
intake_weekday                79672
intake_hour                   79672
intake_number                 79672
time_in_shelter               79672
time_in_shelter_days          79672
dtype: int64

In [25]:
animal_new_df.dtypes

id                              int32
age_upon_outcome               object
animal_id_outcome              object
date_of_birth                  object
outcome_type                   object
sex_upon_outcome               object
age_upon_outcome_days           int64
age_upon_outcome_years        float64
age_upon_outcome_age_group     object
outcome_datetime               object
outcome_month                   int64
outcome_year                    int64
outcome_monthyear              object
outcome_weekday                object
outcome_hour                    int64
outcome_number                float64
dob_year                        int64
dob_month                       int64
dob_monthyear                  object
age_upon_intake                object
animal_id_intake               object
found_location                 object
intake_condition               object
intake_type                    object
sex_upon_intake                object
count                           int64
age_upon_intake_days            int64
age_upon_intake_years         float64
age_upon_intake_age_group      object
intake_datetime                object
intake_month                    int64
intake_year                     int64
intake_monthyear               object
intake_weekday                 object
intake_hour                     int64
intake_number                 float64
time_in_shelter                object
time_in_shelter_days          float64
dtype: object